[
  {
    "country": "Afghanistan",
    "celebrated": "No",
    "date": "-",
    "notes": "Christmas and Christianity are actively—and at times violently—discouraged by the current rulers of Afghanistan"
  },
  {
    "country": "Albania",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Albania is an atheist state, but the secular aspects of Christmas are gaining in popularity"
  },
  {
    "country": "Algeria",
    "celebrated": "No",
    "date": "-",
    "notes": "Algeria is less than 2% Christian, though shops may offer secular Christmas items for expats and tourists"
  },
  {
    "country": "Andorra",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Traditional decorations include a small log with a face drawn on one end and \"the caganer,\" a squatting person with their pants down"
  },
  {
    "country": "Angola",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Traditional foods include polenta-like \"pirão\" or \"funge,\" spaghetti, french fries, turkey, fried chicken, various fish dishes, and \"bolo rei\" cake for dessert"
  },
  {
    "country": "Antigua and Barbuda",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Classic celebrations included \"long ghosts,\" masked figures up to 12 feet tall that would peek inside windows and request donations"
  },
  {
    "country": "Argentina",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Paper lanterns, called '\"globos,\" are often released on Christmas Eve"
  },
  {
    "country": "Armenia",
    "celebrated": "Yes",
    "date": "1/6/2022",
    "notes": "Usually celebrated January 6th, as Aremenians are largely Orthodox. Religious focus, typically without Santa Claus"
  },
  {
    "country": "Australia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas happens in the summer, caroling is popular, and children often leave carrots for Santa's reindeer"
  },
  {
    "country": "Austria",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Most presents come from the “Christkind” (baby Jesus), but Santa and his horned opposite Krampus may still visit"
  },
  {
    "country": "Azerbaijan",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "The Azerbaijani Santa, Shakhta Babah, comes on New Year’s Eve"
  },
  {
    "country": "Bahamas",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Celebrations revolve around \"junkanoo\" parades, complete with music and elaborate, Mardi-Gras-style costumes"
  },
  {
    "country": "Bahrain",
    "celebrated": "No",
    "date": "-",
    "notes": "While the country does not celebrate Christmas, many hotels and shops offer Christmas event and items for tourists"
  },
  {
    "country": "Bangladesh",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas is known as “Bara Din,” which means “the big day” in Bengali"
  },
  {
    "country": "Barbados",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Traditional foods include great cake (fruitcake, often frosted), jug jug (haggis-like dish with peas and salted meat) and baked ham"
  },
  {
    "country": "Belarus",
    "celebrated": "Yes",
    "date": "Both",
    "notes": "A popular holiday film is \"S Legkim Parom\" (translated \"The Irony of Fate\" or \"Enjoy your Bath\"), a romantic comedy about a man who gets very lost after having a sauna with friends."
  },
  {
    "country": "Belgium",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "\"Sinterklaas/St. Niklaas\" brings gifts on Dec. 5 or 6, while Christ's birth is celebrated on Dec 25 "
  },
  {
    "country": "Belize",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Celebrated with boat parades and costume-heavy Christmas dances including the \"charikanari,\" in which a hunter searches for a \"two-foot cow\""
  },
  {
    "country": "Benin",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Few people in this country can afford gifts, so the focus is upon celebrating with family"
  },
  {
    "country": "Bhutan",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Bhutan is less than 1% Christian but the holiday's secular aspect is growing in popularity"
  },
  {
    "country": "Bolivia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas occurs on Dec. 25, but children leave their shoes outside on Jan. 06 and awake to find them filled with presents"
  },
  {
    "country": "Bosnia and Herzegovina",
    "celebrated": "Yes",
    "date": "Both",
    "notes": "Celebrated Dec. 25 by Catholics and Jan. 07 by Orthodox Christians, holiday meals often include fish, greens, and hurmašica cake for dessert"
  },
  {
    "country": "Botswana",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas traditions include visiting one another's cattle grazing land and singing carols"
  },
  {
    "country": "Brazil",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Some say Santa Claus wears silk to stay cool in Brazil, where Christmas occurs during the summer"
  },
  {
    "country": "Brunei",
    "celebrated": "No",
    "date": "-",
    "notes": "Public Christmas celebrations were banned in Brunei in 2015, with violators subject to fines or imprisonment up to five years. Oddly, Christmas Day is still a government holiday"
  },
  {
    "country": "Bulgaria",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Traditional Christmas Eve meal includes a loaf of bread with a coin inside, which will grant good fortune to whomever finds it"
  },
  {
    "country": "Burkina Faso",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Children in this country build clay \"cribs\" to symbolize the birthplace of Jesus"
  },
  {
    "country": "Burundi",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas is largely about gathering together, celebrating, and dancing"
  },
  {
    "country": "Cambodia",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Cambodia is 88%-95% buddhist, but secular aspects of Christmas are growing in popularity"
  },
  {
    "country": "Cameroon",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Holiday traditions include French-inspired \"Buche de Noel,\" a rolled cake that resembles a yule log"
  },
  {
    "country": "Canada",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Different regional traditions include a taffy pull for singles and both \"mummering\" and \"belsnickeling,\" in which costumed Santas go door-to-door"
  },
  {
    "country": "Cabo Verde",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "This African island country is largely Roman Catholic and follows most Christian traditions, including feasts, family, and caroling"
  },
  {
    "country": "Central African Republic",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Poverty is an ongoing concern in this African country, but the holiday is still observed"
  },
  {
    "country": "Chad",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Chad is a Muslim nation, but still celebrates Christmas as a time to be together with family"
  },
  {
    "country": "Chile",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Popular holiday drink is \"cola de mono\" (translated \"monkey’s tail\"), a blend of milk, coffee, sugar, cinnamon, and alcohol"
  },
  {
    "country": "China",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Popularity of secular Christmas is growing, with a focus on romance and time spent with loved ones. Santa plays saxophone and has sisters rather than elves"
  },
  {
    "country": "Colombia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas celebration begins with \"Noche de las velitas\" (\"candle night\") on Dec. 07, followed by nightly \"novenas\" celebrations from Dec. 16 until Christmas"
  },
  {
    "country": "Comoros",
    "celebrated": "No",
    "date": "-",
    "notes": "In this Muslim nation, it is illegal to openly celebrate Christian theology and traditions"
  },
  {
    "country": "Costa Rica",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Celebrations last until the Feast of the Three Kings on Jan. 06, which commemorates the wise men's arrival in Bethlehem"
  },
  {
    "country": "Croatia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "One old Croatian tradition is for young men to give their girlfriends a decorated apple for Christmas "
  },
  {
    "country": "Cuba",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Fidel Castro canceled the national Christmas holiday in 1969, but reinstated it as a \"leisure day\" in 1998, at the pope's request"
  },
  {
    "country": "Cyprus",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Cypriot traditions tell of mischievous spirits called  \"kalikantzari\" (or calicantzari) that could enter houses through the chimney from Christmas Eve until Jan. 06 "
  },
  {
    "country": "Czechia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas folk traditions including placing fish scales under dinner plates to ensure financial success and cutting an apple in half to predict one's upcoming health"
  },
  {
    "country": "Denmark",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Traditional Christmas dessert is \"risalamande,\" a rice pudding made with vanilla and almonds and often covered with warm cherry sauce"
  },
  {
    "country": "Djibouti",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Though the Christian population is small, the holiday is eagerly observed"
  },
  {
    "country": "Dominica",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Tradition says one must deep-clean one's home before Christmas Eve even if no guests are expected"
  },
  {
    "country": "Dominican Republic",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas celebrations begin in October and often include fireworks. Instead of fresh-cut trees, most people decorate carved trees called \"charamicos\""
  },
  {
    "country": "Congo (Kinshasa)",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Many churches perform marathon Christmas Eve plays that depict Biblical stories from creation until King Herod's order to kill all the young boys of Israel, with Jesus' birth timed to take place as close to midnight as possible "
  },
  {
    "country": "Ecuador",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas Eve parades can take all day and always end with a float carrying a statue of the baby Jesus, or \"Niño Viajero\""
  },
  {
    "country": "Egypt",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "Celebrations often include stories of the years Joseph, Mary, and Jesus spent in Egypt after escaping King Herod"
  },
  {
    "country": "El Salvador",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Popular Christmas traditions include fireworks, nativity scenes, and going to the beach on Christmas Day"
  },
  {
    "country": "Equatorial Guinea",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "In addition to the usual Roman Catholic celebrations, revelers in the Bioko region often perform a traditional dance called \"balélé\""
  },
  {
    "country": "Eritrea",
    "celebrated": "Yes",
    "date": "Both",
    "notes": "Most Eritrean Christians are Orthodox. As in many countries with Orthodox churches, they go on a 40-day vegan fast and eat no meat from Nov. 25 until Christmas"
  },
  {
    "country": "Estonia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Traditional Christmas foods include blood sausage, sauerkraut, tangerines and gingerbread. Santa is known to ask for poems in exchange for gifts"
  },
  {
    "country": "Eswatini",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas in this developing country is focused upon worship and having special meals with family and friends"
  },
  {
    "country": "Ethiopia",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "In addition to Christmas, Ethiopians celebrate Timkat, a three-day event commemorating Jesus' baptism, starting on Jan 19"
  },
  {
    "country": "Fiji",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Celebrations often include traditional fan dances by women and spear dances by men"
  },
  {
    "country": "Finland",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Finland is the home country of Santa Claus—whose Finnish name, \"Joulupukki,\" references the fact that Finnish Santa was originally a frightening goat who asked people to give him presents"
  },
  {
    "country": "France",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "French nativity scenes often include additional figures such as a butcher, baker, priest, or policeman. Christmas dinner may feature up to 13 desserts"
  },
  {
    "country": "Gabon",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Many regions of this 80% Christian nation incorporate bits of indigenous tradition into their Christmas celebration"
  },
  {
    "country": "Gambia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Celebration includes parades of \"fanals,\" elaborate boat-shaped lanterns made of bamboo and paper"
  },
  {
    "country": "Georgia",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "Georgian Christmas trees, or \"chichilaki\", are hand-carved from dried wood and burned on Jan. 19th as a symbol that the past year's troubles are gone"
  },
  {
    "country": "Germany",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Germany is known for the thousands of enchanting Christmas markets that pop up during the holiday season"
  },
  {
    "country": "Ghana",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas feasts are a main focus, with people eating up to five times a day during the two-week holiday celebration"
  },
  {
    "country": "Greece",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Celebrations last from Christmas Eve to the Epiphany Jan. 06. and often include the decorating of small boats and the baking of \"Christopsomo,\" an elaborately decorated hoilday bread"
  },
  {
    "country": "Greenland",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The traditional Christmas decoration in Greenland is a star-shaped paper lantern"
  },
  {
    "country": "Grenada",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Popular holiday dessert is \"black Christmas cake\", a dense, rich cake filled with fruit that has soaked in wine and rum since October"
  },
  {
    "country": "Guatemala",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "On Dec. 07, Guatemalans celebrate \"La Quema del Diablo\" (The Burning of the Devil), in which they set fire to pinata-like caricatures of Satan"
  },
  {
    "country": "Guinea",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Though Christians make up only about 10% of this country's population, holiday festivals are generally welcomed"
  },
  {
    "country": "Guyana",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The traditional Christmas meal is pepperpot, a rich stew made with cinnamon, clove, brown sugar, orange peel, hot pepper, and cassareep, a syrupy brown sauce extraced from the cassava root"
  },
  {
    "country": "Haiti",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas includes making \"fanals\" (from the French word for \"lantern\"), which are paper lanterns made to look like houses and lit with candles (and which are shaped like boats in Gambia)"
  },
  {
    "country": "Honduras",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "As in many American and African countries, Christmas is often celebrated with fireworks and \"estreno\", or \"new clothes\""
  },
  {
    "country": "Hong Kong",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "A former British colony, Hong Kong may celebrate Christmas more enthusiastically than any other country in Asia. The territory-wide \"Winterfest\" celebration is a highlight"
  },
  {
    "country": "Hungary",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Saint Nicholas (\"Mikulás\" in Hungarian) visits Dec. 06 and puts goodies in children's shoes, but the larger gifts come from baby Jesus the night of Dec. 24"
  },
  {
    "country": "Iceland",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas lasts from Dec. 11 to Jan. 06 (26 days) during which thirteen \"Yule Lads\" visit in turn, leaving gifts in children's shoes"
  },
  {
    "country": "India",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "India is less than 3% Christian, but Christmas remains a national holiday and is often celebrated with star-shaped lanterns or clay lamps placed on rooftops to signify that Jesus is \"the light of the world\" "
  },
  {
    "country": "Indonesia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Many regions have their own unique holiday customs. For example, Christmas trees in Bali are often made from chicken feathers"
  },
  {
    "country": "Iran",
    "celebrated": "Unofficially",
    "date": "1/6/2022",
    "notes": "Christians in Iran are usually Armenian immigrants, who celebrate on Jan. 6-7. Muslim Iranians can be jailed or killed for becoming Christian"
  },
  {
    "country": "Iraq",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas was made a national holiday in 2018. The nonreligious aspects of the holiday are rapidly gaining in popularity"
  },
  {
    "country": "Ireland",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Uniquely Irish Christmas traditions include swimming in the Irish Sea and reading James Joyce's short story, \"The Dead\""
  },
  {
    "country": "Israel",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Less than 3% of Israel is Christian, but those who are have the freedom to celebrate as they choose"
  },
  {
    "country": "Italy",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Italians love nativity scenes, and often add extra animals, people, or structures. Naples' nativity scene reportedly includes more than 600 pieces"
  },
  {
    "country": "Cote d'Ivoire",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas Eve church services start at midnight and often last up to six hours, with poems, skits, and dances added to the sermons"
  },
  {
    "country": "Jamaica",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Holiday traditions include the \"jonkanoo\" parade of costumed characters and the Grand Market, a combination bazaar and street festival"
  },
  {
    "country": "Japan",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Few Christians, but the secular aspect of the holiday is quite popular. The traditional Christmas Eve meal is fried chicken from the U.S.-based chain KFC "
  },
  {
    "country": "Jordan",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "While only 10% of Jordan is Christian, the Muslim majority welcomes Christmas and enjoys the holiday's secular elements"
  },
  {
    "country": "Kazakhstan",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "Christians are a minority and follow the Orthodox church. The New Year's holiday co-opted most secular elements, including decorated trees and a bearded \"Snow Father\" who brings presents on New Year's Eve "
  },
  {
    "country": "Kenya",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Families gather together from all around, often seeing one another for the only time that year"
  },
  {
    "country": "Kiribati",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Thanks to the warm weather in this island nation, Christmas celebrations often include activities such as camping, canoe racing, or fishing contests"
  },
  {
    "country": "Kuwait",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "While the small Christian minority is generally allowed to celebrate Christmas, conservative Muslims often take offense if towns or businesses decorate"
  },
  {
    "country": "Kyrgyzstan",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "As in many other post-Soviet countries, the trees, gift-giving, and other secular aspects of Christmas take place on New Year's Eve instead "
  },
  {
    "country": "Laos",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Laos is more than 98% Muslim, but the roughly 2% of the population who are Christians are free to celebrate as they wish"
  },
  {
    "country": "Latvia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Latvia claims the first recorded instance of a Christmas tree, having erected one in its capital city, Riga, in 1510"
  },
  {
    "country": "Lebanon",
    "celebrated": "Yes",
    "date": "Both",
    "notes": "As Lebanon has significant numbers of both Orthodox and non-Orthodox Christians, the government celebrates both Christmas on Dec. 25 and Armenian Orthodox Christmas on Jan. 06"
  },
  {
    "country": "Lesotho",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "A common holiday drink in Lesotho is \"joala ba sesotho,\" a homemade beer which takes roughly four days to prepare"
  },
  {
    "country": "Liberia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Founded by freed American slaves, Liberia shares most U.S. Christmas traditions but has added one: Old Man Beggar, a jolly beggar in ragged clothes who often competes with Santa to see who is the better entertainer"
  },
  {
    "country": "Libya",
    "celebrated": "No",
    "date": "-",
    "notes": "Most Libyans are Muslim and so do not celebrate Christmas, and Christians are violently persecuted by some Libyan groups"
  },
  {
    "country": "Liechtenstein",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Also celebrated is the Epiphany on Jan. 06, commemorating the wise men's arrival in Bethlehem"
  },
  {
    "country": "Lithuania",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas traditions include watching the film Home Alone, having 12 dishes at dinner, and eating \"Kūčiukai,\" which are tiny biscuits served in a bowl of poppy milk"
  },
  {
    "country": "Luxembourg",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The traditional Christmas meal is \"Träipen mat Gromperenzalot,” a sort of black pudding with potatoes and often applesauce. "
  },
  {
    "country": "Macau",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The \"Las Vegas of Asia\" was a Portuguese colony until 1999 and follows many European Christmas traditions"
  },
  {
    "country": "Madagascar",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Despite being native to Mexico, poinsettia trees are the floral emblem of Madagascar, where they are beloved "
  },
  {
    "country": "Malawi",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "As in many poor South African nations, Christmas in Malawi is sparse by Western traditions and focused upon time spent with family "
  },
  {
    "country": "Malaysia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Few Christians, but the secular holiday is widely celebrated, though decorations are taken down immediately in preparation for New Year's celebrations"
  },
  {
    "country": "Maldives",
    "celebrated": "No",
    "date": "-",
    "notes": "While many resorts catering to tourists eagerly welcome the Christmas season, the country as a whole ignores it"
  },
  {
    "country": "Mali",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "While Christmas has little secular presence in this majority Muslim country, the Christian minority celebrates with all-night Christmas Eve church services"
  },
  {
    "country": "Malta",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "In Malta's unique holiday tradition \"Priedka tat-Tifel,\" which translates to \"the preaching of the child,\" a youngster aged 7-10 preaches the sermon at midnight mass"
  },
  {
    "country": "Marshall Islands",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Holiday celebrations in this island nation involves months of planning and playful day-long song-and-dance competitions between groups called jeptas"
  },
  {
    "country": "Mauritania",
    "celebrated": "No",
    "date": "-",
    "notes": "Although they do celebrate the winter solstice on Dec. 21, the people of this nearly 100% Muslim country typically ignore Christmas"
  },
  {
    "country": "Mauritius",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Although Christmas comes mid-summer, most of the traditional Western celebrations remain, from church services and Santa Claus to the French-inspired Bûche de Noël (Yule Log) cake for dessert"
  },
  {
    "country": "Mexico",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas beings in earnest on Dec. 12, the day the nativity scene is set up, and runs through Three Kings' Day on Jan 06"
  },
  {
    "country": "Micronesia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas day is often spent in hours-long church celebrations. Micronesia is also a partner in Operation Christmas Drop, an annual event in which the U.S. Air Force practices delivering humnitarian supplies by dropping crates filled with food, toys, and other needed items "
  },
  {
    "country": "Moldova",
    "celebrated": "Yes",
    "date": "Both",
    "notes": "Deeply Christian but divided between two churches following different calendars, Moldovans celebrate on Dec. 25 or Jan. 07"
  },
  {
    "country": "Monaco",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "One Christmas tradition calls for thirteen desserts, symbolizing Christ and the twelve apostles. The final dessert is \"La Pompe,\" a sweet bread that is broken by hand, as Christ broke bread at the Last Supper. "
  },
  {
    "country": "Mongolia",
    "celebrated": "No",
    "date": "-",
    "notes": "Influenced by the former Soviet Union, the people of this Buddhist nation do not celebrate Christmas, but do put up New Year's trees and await a visit from \"Grandpa Winter\""
  },
  {
    "country": "Montenegro",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "Christmas traditions include spreading straw under the table and clucking like a chicken, which symbolizes the Bethlehem stable and Christ's desire for his people to gather together and follow him"
  },
  {
    "country": "Morocco",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Secular Christmas is becoming more prominent (especially in cities), but many people in this Muslim nation are unclear about whether Islam allows the holiday"
  },
  {
    "country": "Mozambique",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Alternately called \"Family Day,\" but still retains most of the Christmas trappings, including church services, trees, and family gatherings"
  },
  {
    "country": "Myanmar",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas is technically a government holiday, but the democratic government was desposed in a 2021 military coup"
  },
  {
    "country": "Namibia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Namibians often enjoy German Christmas cookies or Dutch \"Appelflappen\" beignets as part of their holiday tradition"
  },
  {
    "country": "Nauru",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The people of this majority Christian nation, one of the smallest countries in the world, often include cakes made with banana or coconut in their Christmas celebrations "
  },
  {
    "country": "Nepal",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Traditional Christmas dishes in Nepal include \"sel roti\" (fried bread), \"dal bhat tarkari\" (vegetable curry), \"thukpa\" (chicken soup), \"momos\" (meat dumplings), and \"yomari\" (sesame dumplings)"
  },
  {
    "country": "Netherlands",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Santa Claus (\"Sinterklaas\") comes the night of Dec. 05 in Netherlands, but typically returns with more presents on Dec. 25. "
  },
  {
    "country": "New Zealand",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Children may leave pineapple out for Santa. New Zealand's own native \"Christmas tree\", the Pōhutukawa, is a broad, umbrella-shaped tree that sports massive red flowers in December"
  },
  {
    "country": "Nicaragua",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Nicaragua's Christmas celebration begins the evening of Dec. 07, La Purísima, when the the immaculate conception is celebrated with fireworks, sweets, and carolers"
  },
  {
    "country": "Niger",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Although Christmas is a national holiday, less than 1% of Niger's people are Christians, so the holiday is only lightly celebrated"
  },
  {
    "country": "Nigeria",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The day after Christmas, many churches go on a short trip, symbolizing the journey of the wise men, and celebrate with a \"love feast\""
  },
  {
    "country": "Korea, North",
    "celebrated": "No",
    "date": "-",
    "notes": "Ruled by an authoritarian regime, this country has prohibited Christmas celebrations"
  },
  {
    "country": "North Macedonia",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "In this Orthodox nation, the Christmas holiday begins with caroling on Jan. 05, or \"Kolede,\" and typically lasts until three days after Christmas"
  },
  {
    "country": "Norway",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Norwegians often decorate their Christmas trees with heart-shaped paper baskets called \"Julekurver\""
  },
  {
    "country": "Oman",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "While Oman is a Muslim-majority nation, Christians are welcome to to celebrate their faith, and the secular aspect of Christmas is observed by many"
  },
  {
    "country": "Pakistan",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Dec. 25 is Quaid-e-Azam Day, which celebrates the birth of Pakistan's founder. The tiny Christian minority are allowed by law to celebrate Christmas, but often do so discreetly for fear of violence from individuals"
  },
  {
    "country": "Palau",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The holidays in this largely Christian country focus upon appreciating the birth of Jesus and gathering together with family"
  },
  {
    "country": "Palestine",
    "celebrated": "Yes",
    "date": "Both",
    "notes": "Palestinian territory includes Bethlehem, where Jesus was born. The region is only 20% Christian, but because some are Orthodox and others are not, both Dec. 25 and Jan. 07 are government holidays"
  },
  {
    "country": "Panama",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "In addition to Christmas feasts and celebrations, Panamanians often craft \"muñeca,\" large paper-mache figures resembling celebrities or politicians whom they dislike, and burn them on New Year's Eve"
  },
  {
    "country": "Papua New Guinea",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "This South Pacific nation first welcomed Christianity some 200 years ago and shares many of the same Christmas traditions as nearby Australia"
  },
  {
    "country": "Paraguay",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "As in many countries, nativity scenes are deeply important in Paraguay, with families often arranging the figures on boards covered in real soil with sprouted rice serving as vegetation"
  },
  {
    "country": "Peru",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Peruvians preparing for Christmas often host \"chocolatadas\"—gatherings in which people get together and drink hot chocolate and share \"panetón\" (for \"panettone,\" the Italian Christmas sweet bread)"
  },
  {
    "country": "Philippines",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The most popular Christmas decoration in the Philppines is the \"parol,\" a multicolored, star-shaped paper lantern hung on a bamboo pole, which symbolizes the star of Bethlehem"
  },
  {
    "country": "Poland",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Polish people often leave a spare seat at the holiday table to commemorate passed or absent loved ones and so they are prepared to welcome a \"niespodziewany gość,\" or \"unexpected guest\""
  },
  {
    "country": "Portugal",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "From Christmas through the start of January, the Portuguese go door to door with a picture of Jesus and sing \"Janeiras\" (January songs). Hosts who do not invite the carolers inside to warm up and have a snack may be ridiculed in song "
  },
  {
    "country": "Qatar",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "While Qatar is a Muslim majority nation, hotels and shops celebrate the holiday for tourists, expats, and the small Christian minority"
  },
  {
    "country": "Congo (Brazzaville)",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas celebrations in Congo center around church services and activities, which often incorporate plays and musical performances and can last for hours"
  },
  {
    "country": "Romania",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Romanian Christmas traditions include \"dubasi,\" which are bands of unmarried male drummers (accompanied by sax and violin), and the \"capra,\" a person dressed as a goat who causes mischief within choirs of carolers"
  },
  {
    "country": "Russia",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "Christmas was abolished from 1929 to 1992, but New Year's Day became very Christmas-adjacent, absorbing traditions such as tree-decorating and the Santa-like \"Winter Father\" "
  },
  {
    "country": "Rwanda",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "While Rwandans are free to celebrate Christmas, the New Year's holiday is of vastly greater national significance"
  },
  {
    "country": "Saint Kitts and Nevis",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas in this Caribbean country is followed by J'ouvert morning on Dec. 26, when residents don carnival costumes and dance in musical street parades that start as early as 5am"
  },
  {
    "country": "Saint Lucia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Saint Lucia's best-known holiday tradition is \"bamboo bursting,\" in which locals ignite fuel poured into hollowed bamboo canes, which then make a cannon-like boom"
  },
  {
    "country": "Saint Vincent and the Grenadines",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The \"Nine Mornings\" festival in this country features 3am church services followed by street parades, music, and dancing that often runs until 7am every day from Dec. 16 to 24"
  },
  {
    "country": "Samoa",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas in this predominantly Catholic nation includes a 13-day carol singing event so popular it is broadcast on national television"
  },
  {
    "country": "San Marino",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas highlights in this tiny microcountry include an ice rink and a neighborhood-sized holiday market that transforms the area near Campo Bruno Reffi"
  },
  {
    "country": "Sao Tome and Principe",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas is one of the most eagerly celebrated days of the year in this majority Catholic country, which focuses more on the spiritual aspect of the day than its secular elements"
  },
  {
    "country": "Saudi Arabia",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Christmas was previously banned in this rigidly Muslim country, but government regulations have loosened in recent years, enabling citizens to begin to partake in the secular aspect of Christmas"
  },
  {
    "country": "Senegal",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Senegal's Muslim majority lives in harmony with the Christian minority and many Muslims share in the Christmas celebration, even decorating mosques with Christmas trees"
  },
  {
    "country": "Serbia",
    "celebrated": "Yes",
    "date": "1/7/2022",
    "notes": "In Serbian tradition, girls went out Christmas morning to collect \"strong water,\" which was said to have special powers. It was often included when making \"česnica,\" an ornate holiday bread"
  },
  {
    "country": "Seychelles",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas in this tropical island nation greatly resembles Christmas in any developed Christian country, complete with family time, food, church services, trees, and gifts"
  },
  {
    "country": "Sierra Leone",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas in Sierra Leone is known for its numerous street carnivals and copious amounts of food, much of which is sent to friends who respond by sending food gifts of their own"
  },
  {
    "country": "Singapore",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Less than 20% of the population is Christian, but secular aspects of Christmas are enthusiastically embraced by all. Popular Christmas tree decorations include candy, ribbons and teddy bears"
  },
  {
    "country": "Slovakia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "One of the most beloved Christmas movies in Slovakia is \"Tri oriešky pre popolušku\" (\"Three Gifts for Cinderella\"), a wintery retelling of the Cinderella tale with magic walnuts in place of the Fairy Godmother"
  },
  {
    "country": "Slovenia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "A Slovenian custom holds that the women of each family would gather together and bake three loaves of holiday bread: one for Christmas, one for New Year's, and one for Jan. 06, the day the wise men arrived at Bethlehem "
  },
  {
    "country": "Solomon Islands",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas in this former British Colony in Oceania is largely non-commercial, devoted instead to church services and spending time with loved ones"
  },
  {
    "country": "Somalia",
    "celebrated": "No",
    "date": "-",
    "notes": "Christmas celebrations are banned in this country, where non-Muslim traditions are seen as an offense to the faith"
  },
  {
    "country": "South Africa",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "South African Christmas follows most European traditions, but because it's summer in December, Christmas often also involves camping, the beach, or a traditional South African barbeque feast called a braai"
  },
  {
    "country": "Korea, South",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christianity is the largest religion in this largely secular nation, where Christmas is viewed as not only a religious and family-oriented holiday, but also a romantic one akin to Valentine's Day"
  },
  {
    "country": "South Sudan",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Many of this Christian nation's 67 tribes have their own holiday traditions, from fixing up the house and teaching younger generations to partying with loved ones "
  },
  {
    "country": "Spain",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Midnight mass in Spain is known as \"La Misa Del Gallo\" (The Mass of the Rooster), after which people often take to the streets to play guitar, drums, and tambourines. Most presents are opened on Jan. 06 (the Epiphany)"
  },
  {
    "country": "Sri Lanka",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas celebrations in this Asian country are influenced by British, Dutch, and Portuguese customs, and begin with firecrackers on the morning of Dec. 01"
  },
  {
    "country": "Sudan",
    "celebrated": "Yes",
    "date": "Both",
    "notes": "Christmas celebrations were declared illegal in this Muslim majority country in 2011, but the ban was lifted in 2021, enabling Christians to worship again, and both Dec. 25 and Jan. 07 were declared national holidays"
  },
  {
    "country": "Suriname",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "This South American country welcomes Santa, who has dark skin and is known as \"Goedoe Pa\" (Dearest Daddy), the night of Dec. 05, enabling citizens to focus fully on Christ's birth on Dec. 25"
  },
  {
    "country": "Sweden",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Sweden also celebrates St. Lucia Day on Dec. 13. The holiday commemorates a young girl, martyred in 304 AD, who secretly delivered food to persecuted Christians hiding in the catacombs of Rome"
  },
  {
    "country": "Switzerland",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Many Swiss communities have traditions in which people parade through town, often in masks or costumes, making noise, banging drums, and/or singing to either ward off evil spirits or wish neighbors a good upcoming year"
  },
  {
    "country": "Syria",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "According to Syrian legend, the littlest camel in the three wise men's caravan was exhausted by the journey, but refused to give up the chance to meet the baby Jesus. Upon learning of the little camel's devotion, Jesus blessed it with immortality and entrusted it to bring gifts to children every year"
  },
  {
    "country": "Taiwan",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Although Dec. 25 is Constitution Day and Christmas is not a national holiday, the Taiwanese are quite familiar with and welcoming toward the secular elements of the holiday"
  },
  {
    "country": "Tajikistan",
    "celebrated": "No",
    "date": "-",
    "notes": "This former Soviet state has outlawed both the Christian and Secular aspects of Christmas, including the giving of gifts and sharing of feasts"
  },
  {
    "country": "Tanzania",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Tribes in this Christian-majority African country tend to keep the focus simple by attending church services and sharing a festive day with family, though new clothes and small gifts for the children may also be exchanged"
  },
  {
    "country": "Thailand",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Thailand is overwhelmingly Buddhist, but its people are accepting of Christians. Santa often appears in schools, and Christmas celebrations and decorations are quite common, particularly in cities and tourist areas"
  },
  {
    "country": "Timor-Leste",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Many towns in this largely Catholic country in the South Pacific construct life-sized nativity scenes, which the town children keep watch over for all twelve days of Christmas, until the Epiphany on Jan. 06"
  },
  {
    "country": "Togo",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Holiday traditions in Togo, which is more than 40% Christian, are heavily influenced by French customs, both the spiritual (church services) and the secular (Santa, Christmas trees) "
  },
  {
    "country": "Tonga",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "This multi-island nation enjoys the unique tradition of \"tutukupakanava,\" also called Tongan Christmas lights, in which coconut husks are arranged on a beach and set aflame"
  },
  {
    "country": "Trinidad and Tobago",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Revelers in this country often form roaming bands of carolers and sing \"parang\", a Spanish-language music that combines the styles of Venezuela and Trinidad and is often accompanied by guitars, violins, maracas, and wood blocks"
  },
  {
    "country": "Tunisia",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Christmas is just another work day for most people in this Muslim country. That said, the tiny Christian minority celebrates freely and many merchants and hotels offer Christmas-themed items"
  },
  {
    "country": "Turkey",
    "celebrated": "Unofficially",
    "date": "Both",
    "notes": "Less than 1% of this Muslim majority country is Christian, but those that do dwell there are free to worship. The original Saint Nicholas lived in the region that is now Turkey"
  },
  {
    "country": "Turkmenistan",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "More than 90% Muslim, Turkmenistan does not treat Christmas as a national holiday, but the Christian minority is free to worship as they wish. Secular Christmas traditions are rarely seen"
  },
  {
    "country": "Tuvalu",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas in Tuvalu is typically focused upon church services and spending time with family ... possibly at the beach"
  },
  {
    "country": "Uganda",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas is called \"Sekukkulu\" in Uganda. Santa Claus is not part of the tradition, but foods made with Matooke (an indigenous fruit) are a staple. "
  },
  {
    "country": "Ukraine",
    "celebrated": "Yes",
    "date": "Both",
    "notes": "In some parts of Ukraine, Christmas trees include an ornament shaped like a spider's web. This is a reference to the tale of the \"Christmas spider,\" in which a poor family discovers on Christmas morning that spiderwebs in their tree have turned to silver and gold"
  },
  {
    "country": "United Arab Emirates",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Christmas is not a national holiday in this Muslim-majority country, but its secular aspects are typically embraced, especially in tourist-friendly locations. The Emirates Palace hotel in Abu Dhabi erects the world's most expensive Christmas tree each year, with ornaments worth millions of dollars"
  },
  {
    "country": "United Kingdom",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "The U.K. originated the idea of \"Boxing Day,\" the day after Christmas, in which servants were given the day off (often with gifts) and the donation boxes in churches were opened and their contents given to those in need"
  },
  {
    "country": "US",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Both the spiritual and secular aspects of Christmas are widely celebrated in the United States. Regional communities often incorporate customs from their homelands, such as the mummers' parade in Philadelphia or the appearance of paper-lantern \"farolitos\" in Latino communities"
  },
  {
    "country": "Uruguay",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "While the government calls Dec. 25 the \"Day of the Family,\" it is Christmas in all but name, complete with a visit from \"Papa Noel.\" However, the larger gift-giving day is Jan. 06, \"Children's Day,\" which celebrates the arrival of \"Los tres Reyes Magos\" (the three magi kings) in Bethlehem"
  },
  {
    "country": "Uzbekistan",
    "celebrated": "No",
    "date": "Both",
    "notes": "declaring it  "
  },
  {
    "country": "Vanuatu",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Although many people in this island nation will attend church services on Christmas Eve and Christmas Day, the holiday is predominantly about reuniting with family and friends and sharing time with them"
  },
  {
    "country": "Venezuela",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Christmas fireworks are very popular in this South American country. In the capital, Caracas, so many people rollerskate to morning church services from Dec. 16-24 that authorities often close the roads to vehicular traffic"
  },
  {
    "country": "Vietnam",
    "celebrated": "Unofficially",
    "date": "12/25/2022",
    "notes": "Largely secular in nature. Those who do celebrate tend to follow French customs, such as ending the Christmas \"reveillon,\" or feast, with a \"bûche de Noël,\" a log-shaped chocolate cake"
  },
  {
    "country": "Yemen",
    "celebrated": "No",
    "date": "-",
    "notes": "Yemen is mired in a violent civil war, which has exacerbated an ongoing famine. The few Christians remaining in the country are heavily, and sometimes violently persecuted. Conversion from Islam to Christianity is often punishable by banishment or death"
  },
  {
    "country": "Zambia",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Carolers in Zambia often perform for donations which are turned over to charity, and children are encouraged to bring gifts to other children who are less-fortunate or hospitalized"
  },
  {
    "country": "Zimbabwe",
    "celebrated": "Yes",
    "date": "12/25/2022",
    "notes": "Traditional Christmases in Zimbabwe include new shoes and clothes for the children, a trip to church in the morning, and afternoons spent visiting friends and loved ones at one house party after another "
  }
]